# Customer Segmentation on Mall Customers Data

In [18]:
import pandas as pd

In [19]:
data = pd.read_csv("../dataset/Mall_Customers.csv")
data.head(10)

   CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40
5           6  Female   22                  17                      76
6           7  Female   35                  18                       6
7           8  Female   23                  18                      94
8           9    Male   64                  19                       3
9          10  Female   30                  19                      72

In [20]:
data.sample(10)

     CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
190         191  Female   34                 103                      23
58           59  Female   27                  46                      51
20           21    Male   35                  24                      35
13           14  Female   24                  20                      77
46           47  Female   50                  40                      55
70           71    Male   70                  49                      55
130         131    Male   47                  71                       9
64           65    Male   63                  48                      51
136         137  Female   44                  73                       7
163         164  Female   31                  81                      93

In [21]:
data.shape

(200, 5)

In [22]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              200 non-null    int64
 1   Gender                  200 non-null    object
 2   Age                     200 non-null    int64
 3   Annual Income (k$)      200 non-null    int64
 4   Spending Score (1-100)  200 non-null    int64
dtypes: int64(4), object(1)
memory usage: 7.9+ KB

In [23]:
data.duplicated().sum()

np.int64(0)

In [24]:
data.isnull().sum()

CustomerID                0
Gender                    0
Age                       0
Annual Income (k$)        0
Spending Score (1-100)    0
dtype: int64

In [25]:
data.columns

Index(['CustomerID', 'Gender', 'Age', 'Annual Income (k$)',
       'Spending Score (1-100)'],
      dtype='object')

In [26]:
data["Spending Score (1-100)"].unique()

array([39, 81,  6, 77, 40, 76, 94,  3, 72, 14, 99, 15, 13, 79, 35, 66, 29,
       98, 73,  5, 82, 32, 61, 31, 87,  4, 92, 17, 26, 75, 36, 28, 65, 55,
       47, 42, 52, 60, 54, 45, 41, 50, 46, 51, 56, 59, 48, 49, 53, 44, 57,
       58, 43, 91, 95, 11,  9, 34, 71, 88,  7, 10, 93, 12, 97, 74, 22, 90,
       20, 16, 89,  1, 78, 83, 27, 63, 86, 69, 24, 68, 85, 23,  8, 18])

In [27]:
data.describe()

       CustomerID         Age  Annual Income (k$)  Spending Score (1-100)
count  200.000000  200.000000          200.000000              200.000000
mean   100.500000   38.850000           60.560000               50.200000
std     57.879185   13.969007           26.264721               25.823522
min      1.000000   18.000000           15.000000                1.000000
25%     50.750000   28.750000           41.500000               34.750000
50%    100.500000   36.000000           61.500000               50.000000
75%    150.250000   49.000000           78.000000               73.000000
max    200.000000   70.000000          137.000000               99.000000

In [28]:
data["Gender"].value_counts()

Gender
Female    112
Male       88
Name: count, dtype: int64

In [29]:
gender_counts = data["Gender"].value_counts()
gender_percentage = data["Gender"].value_counts(normalize=True) * 100
print(gender_percentage)

Gender
Female    56.0
Male      44.0
Name: proportion, dtype: float64

In [30]:
data.sample(10)

     CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
51           52    Male   33                  42                      60
32           33    Male   53                  33                       4
110         111    Male   65                  63                      52
82           83    Male   67                  54                      41
116         117  Female   63                  65                      43
39           40  Female   20                  37                      75
104         105    Male   49                  62                      56
69           70  Female   32                  48                      47
94           95  Female   32                  60                      42
13           14  Female   24                  20                      77

In [31]:
# dropping the unnecessary column CustomerID
data = data.drop("CustomerID", axis=1)
data.sample(10)

     Gender  Age  Annual Income (k$)  Spending Score (1-100)
180  Female   37                  97                      32
30     Male   60                  30                       4
135  Female   29                  73                      88
25     Male   29                  28                      82
53     Male   59                  43                      60
196  Female   45                 126                      28
179    Male   35                  93                      90
189  Female   36                 103                      85
69   Female   32                  48                      47
114  Female   18                  65                      48